


const bigDictionary = {
  "Подключ. WM (стандарт)":["Стандартное подключение стиральной машины: производится к уже имеющимся у Вас коммуникациям, без их доработки","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Проверка исправности и готовности к подключению к имеющимся точкам водоснабжения, электроснабжения и системе слива","Снятие транспортных креплений","Установка техники на место эксплуатации и выставление по уровню","Подключение к существующим точкам водо- и электроснабжения с использованием деталей, входящих в комплект, а также с учетом требований производителей техники, «Правил техники безопасности» и контролирующих органов самоуправления, без доработки","Подключение стационарного слива, при необходимости установка манжетки или червячного хомута","Проверка герметичности всех соединений","Проверка работоспособности техники","Очистка рабочей зоны","Демонстрация работы Вашей новой техники и объяснение основных функций","Материалы, входящие в стоимость:","Хомут червячный или муфта","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Выравнивание пола и штробление стен","Работы по изменению конфигурации шкафов или рабочих поверхностей","Встраивание техники в мебель","Доработка коммуникаций и удлинение шнуров питания","Дополнительная информация:","LAST LINE","","","","","","","","","","","","","","","","","","","","","","",""],
  "Подключ. WM (Премиум)":["Премиум подключение стиральной машины: производится установка и подключение техники, а так же доработка  точек водоснабжения, электроснабжения и системы слива","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Проверка исправности и готовности к подключению водоснабжения, электроснабжения и системе слива.","Снятие транспортных креплений","Установка техники на место эксплуатации и выставление по уровню","Доработка сети электроснабжения: установка розетки с заземляющим контактом; Перфорация стен (перегородок) для прокладки коммуникаций; Прокладка электрического кабеля открытым способом (до 5 м.); Монтажные работы в электрощитке.","Доработка системы водоснабжения: Перфорация стен (перегородок) для прокладки коммуникаций; Монтаж водопроводного крана в водосеть клиента; Замена/сращивание/удлинение наливного, шланга (до 4 м.), гибкой подводки;","Доработка системы канализации: Замена/сращивание/удлинение, сливного шланга ( до 1 м.); Организация стационарного слива","Подключение к точкам водо-, электроснабжения и системе канализации с учетом требований производителей техники, «Правил техники безопасности» и контролирующих органов самоуправления","Проверка герметичности всех соединений","Проверка работоспособности техники.","Очистка рабочей зоны","Демонстрация работы Вашей новой техники и объяснение основных функций","Материалы, входящие в стоимость Купона:","Розетка ","Вилка ","Автомат 16 А. / 2п. (отеч.)","Коробка под автомат","Провод ПВС  3*1,5 мм. (белый)","Провод МПВ 4.0 мм (белый)","Крепежные изделия пластиковые зажимы для кабеля 7-8 мм","Сливной шланг до 1 м.","Концевик на модульный сливной шланг","Крепежные хомуты ","Сифон с отводом для подключения СМА и ПММ","Гибкий гофрированный выпуск к сифону","Патрубок прямой - d.40 (d.50) мм.","Ниппель для сращивания сливных шлангов d.19/d.21 мм. (пласт.)","Муфта резиновая d.50*d.73 мм.","Шланг наливной пластиковый (Италия) до 4 м","Подводка гибкая бронированная на воду","Кран","Водоотвод латунный (в сборе)","Тройник","Переходник","Муфта, бочонок.","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Выравнивание пола и штробление стен","Работы по изменению конфигурации шкафов или рабочих поверхностей","Встраивание техники в мебель","Дополнительная информация:","LAST LINE",""],
  "Подключ.В\ WM (стандарт)":["Стандартное подключение встроенной стиральной машины: производится к уже имеющимся у Вас коммуникациям, без их доработки","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Проверка исправности и готовности к подключению к имеющимся точкам водоснабжения, электроснабжения и системе слива","Снятие транспортных креплений","Перфорация стен (мебельных перегородок) для прокладки коммуникаций","Установка техники на место эксплуатации и выставление по уровню","Подключение к существующим точкам водо- и электроснабжения с использованием деталей, входящих в комплект, а также с учетом требований производителей техники, «Правил техники безопасности» и контролирующих органов самоуправления, без доработки","Подключение стационарного слива, при необходимости установка манжетки или червячного хомута","Проверка герметичности всех соединений","Проверка работоспособности техники","Очистка рабочей зоны","Демонстрация работы Вашей новой техники и объяснение основных функций","Материалы, входящие в стоимость Купона:","Хомут червячный или муфта","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Выравнивание пола и штробление стен","Работы по изменению конфигурации шкафов или рабочих поверхностей","Навеска фасада на технику","Доработка коммуникаций и удлинение шнуров питания","Дополнительная информация:","LAST LINE","","","","","","","","","","","","","","","","","","","","","",""],
  "Подключ.В\ WM (Премиум)":["Премиум подключение встраиваемой посудомоечной машины: производится установка и подключение техники, а так же доработка  точек водоснабжения, электроснабжения и системы слива","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Проверка исправности и готовности к подключению к точкам водоснабжения, электроснабжения и системе слива","Снятие транспортных креплений","Перфорация стен (мебельных перегородок) для прокладки коммуникаций","Установка техники на место эксплуатации и выставление по уровню","Доработка сети электроснабжения: установка розетки с заземляющим контактом; Перфорация стен (перегородок) для прокладки коммуникаций; Прокладка электрического кабеля открытым способом (до 5 м.); Монтажные работы в электрощитке.","Доработка системы водоснабжения: Перфорация стен (перегородок) для прокладки коммуникаций; Монтаж водопроводного крана в водосеть клиента; Замена/сращивание/удлинение наливного, шланга (до 4 м.), гибкой подводки;","Доработка системы канализации: Замена/сращивание/удлинение, сливного шланга ( до 1 м.); Организация стационарного слива","Подключение к точкам водо-, электроснабжения и системе канализации, с учетом требований производителей техники, «Правил техники безопасности» и контролирующих органов самоуправления","Проверка герметичности всех соединений","Проверка работоспособности техники.","Очистка рабочей зоны","Демонстрация работы Вашей новой техники и объяснение основных функций","Материалы, входящие в стоимость Купона:","Розетка ","Вилка ","Автомат 16 А. / 2п. (отеч.)","Коробка под автомат","Провод ПВС  3*1,5 мм. (белый)","Провод МПВ 4.0 мм (белый)","Крепежные изделия пластиковые зажимы для кабеля 7-8 мм","Сливной шланг до 1 м.","Концевик на модульный сливной шланг","Крепежные хомуты ","Сифон с отводом для подключения СМА и ПММ","Гибкий гофрированный выпуск к сифону","Патрубок прямой - d.40 (d.50) мм.","Ниппель для сращивания сливных шлангов d.19/d.21 мм. (пласт.)","Муфта резиновая d.50*d.73 мм.","Шланг наливной пластиковый (Италия) до 4 м","Подводка гибкая бронированная на воду","Кран","Водоотвод латунный (в сборе)","Тройник","Переходник","Муфта, бочонок.","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Выравнивание пола и штробление стен","Работы по изменению конфигурации шкафов или рабочих поверхностей","Навеска фасада на технику","Дополнительная информация:","LAST LINE"],
  "Подключ. DW (стандарт)":["Стандартное подключение посудомоечной машины: производится к уже имеющимся у Вас коммуникациям, без их доработки","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Проверка исправности и готовности к подключению к имеющимся точкам водоснабжения, электроснабжения и системе слива","Снятие транспортных креплений","Установка техники на место эксплуатации и выставление по уровню","Подключение к существующим точкам водо- и электроснабжения с использованием деталей, входящих в комплект, а также с учетом требований производителей техники, «Правил техники безопасности» и контролирующих органов самоуправления, без доработки","Подключение стационарного слива, при необходимости установка манжетки или червячного хомута","Проверка герметичности всех соединений","Проверка работоспособности техники","Очистка рабочей зоны","Демонстрация работы Вашей новой техники и объяснение основных функций","Материалы, входящие в стоимость Купона:","Хомут червячный или муфта","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Выравнивание пола и штробление стен","Работы по изменению конфигурации шкафов или рабочих поверхностей","Встраивание техники в мебель","8","Доработка коммуникаций и удлинение шнуров питания","Дополнительная информация:","LAST LINE","","","","","","","","","","","","","","","","","","","","","",""],
  "Подключ. DW (Премиум)":["Премиум подключение посудомоечной машины: производится установка и подключение техники, а так же доработка  точек водоснабжения, электроснабжения и системы слива","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Проверка исправности и готовности к подключению водоснабжения, электроснабжения и системе слива.","Снятие транспортных креплений","Установка техники на место эксплуатации и выставление по уровню","Доработка сети электроснабжения: установка розетки с заземляющим контактом; Перфорация стен (перегородок) для прокладки коммуникаций; Прокладка электрического кабеля открытым способом (до 5 м.); Монтажные работы в электрощитке.","Доработка системы водоснабжения: Перфорация стен (перегородок) для прокладки коммуникаций; Монтаж водопроводного крана в водосеть клиента; Замена/сращивание/удлинение наливного, шланга (до 4 м.), гибкой подводки;","Доработка системы канализации: Замена/сращивание/удлинение, сливного шланга ( до 1 м.); Организация стационарного слива","Подключение к точкам водо-, электроснабжения и системе канализации с учетом требований производителей техники, «Правил техники безопасности» и контролирующих органов самоуправления","Проверка герметичности всех соединений","Проверка работоспособности техники.","Очистка рабочей зоны","Демонстрация работы Вашей новой техники и объяснение основных функций","Материалы, входящие в стоимость Купона:","Розетка ","Вилка ","Автомат 16 А. / 2п. (отеч.)","Коробка под автомат","Провод ПВС  3*1,5 мм. (белый)","Провод МПВ 4.0 мм (белый)","Крепежные изделия пластиковые зажимы для кабеля 7-8 мм","Сливной шланг до 1 м.","Концевик на модульный сливной шланг","Крепежные хомуты ","Сифон с отводом для подключения СМА и ПММ","Гибкий гофрированный выпуск к сифону","Патрубок прямой - d.40 (d.50) мм.","Ниппель для сращивания сливных шлангов d.19/d.21 мм. (пласт.)","Муфта резиновая d.50*d.73 мм.","Шланг наливной пластиковый (Италия) до 4 м","Подводка гибкая бронированная на воду","Кран","Водоотвод латунный (в сборе)","Тройник","Переходник","Муфта, бочонок.","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Выравнивание пола и штробление стен","Работы по изменению конфигурации шкафов или рабочих поверхностей","Встраивание техники в мебель","Дополнительная информация:","LAST LINE",""],
  "Подключ.В\ DW (стандарт)":["Стандартное подключение встроенной посудомоечной машины: производится к уже имеющимся у Вас коммуникациям, без их доработки","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Проверка исправности и готовности к подключению к имеющимся точкам водоснабжения, электроснабжения и системе слива","Снятие транспортных креплений","Перфорация стен (мебельных перегородок) для прокладки коммуникаций","Установка техники на место эксплуатации и выставление по уровню","Подключение к существующим точкам водо- и электроснабжения с использованием деталей, входящих в комплект, а также с учетом требований производителей техники, «Правил техники безопасности» и контролирующих органов самоуправления, без доработки","Подключение стационарного слива, при необходимости установка манжетки или червячного хомута","Проверка герметичности всех соединений","Проверка работоспособности техники","Очистка рабочей зоны","Демонстрация работы Вашей новой техники и объяснение основных функций","Материалы, входящие в стоимость Купона:","Хомут червячный или муфта","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Выравнивание пола и штробление стен","Работы по изменению конфигурации шкафов или рабочих поверхностей","Навеска фасада на технику","Доработка коммуникаций и удлинение шнуров питания","Дополнительная информация:","LAST LINE","","","","","","","","","","","","","","","","","","","","","",""],
  "Подключ.В\ DW (Премиум)":["Премиум подключение встраиваемой посудомоечной машины: производится установка и подключение техники, а так же доработка  точек водоснабжения, электроснабжения и системы слива","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Проверка исправности и готовности к подключению к точкам водоснабжения, электроснабжения и системе слива","Снятие транспортных креплений","Перфорация стен (мебельных перегородок) для прокладки коммуникаций","Установка техники на место эксплуатации и выставление по уровню","Доработка сети электроснабжения: установка розетки с заземляющим контактом; Перфорация стен (перегородок) для прокладки коммуникаций; Прокладка электрического кабеля открытым способом (до 5 м.); Монтажные работы в электрощитке.","Доработка системы водоснабжения: Перфорация стен (перегородок) для прокладки коммуникаций; Монтаж водопроводного крана в водосеть клиента; Замена/сращивание/удлинение наливного, шланга (до 4 м.), гибкой подводки;","Доработка системы канализации: Замена/сращивание/удлинение, сливного шланга ( до 1 м.); Организация стационарного слива","Подключение к точкам водо-, электроснабжения и системе канализации, с учетом требований производителей техники, «Правил техники безопасности» и контролирующих органов самоуправления","Проверка герметичности всех соединений","Проверка работоспособности техники.","Очистка рабочей зоны","Демонстрация работы Вашей новой техники и объяснение основных функций","Материалы, входящие в стоимость Купона:","Розетка ","Вилка ","Автомат 16 А. / 2п. (отеч.)","Коробка под автомат","Провод ПВС  3*1,5 мм. (белый)","Провод МПВ 4.0 мм (белый)","Крепежные изделия пластиковые зажимы для кабеля 7-8 мм","Сливной шланг до 1 м.","Концевик на модульный сливной шланг","Крепежные хомуты ","Сифон с отводом для подключения СМА и ПММ","Гибкий гофрированный выпуск к сифону","Патрубок прямой - d.40 (d.50) мм.","Ниппель для сращивания сливных шлангов d.19/d.21 мм. (пласт.)","Муфта резиновая d.50*d.73 мм.","Шланг наливной пластиковый (Италия) до 4 м","Подводка гибкая бронированная на воду","Кран","Водоотвод латунный (в сборе)","Тройник","Переходник","Муфта, бочонок.","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Выравнивание пола и штробление стен","Работы по изменению конфигурации шкафов или рабочих поверхностей","Навеска фасада на технику","Дополнительная информация:","LAST LINE"],
  "Подключ. дораб.слива ":["Доработка системы слива приобретается дополнительно к стандартной установке техники. При приобретении услуги отдельно, выезд специалиста оплачивается по действующему Прейскуранту цен на работы.","Работы входящие в стоимость:","Замена/сращивание/удлинение, сливного шланга (до 1м.); Организация стационарного слива с гидрозатвором через отдельный сток (установка специального сифона с демонтажем старого), либо частичная замена деталей старого сифона (установка отвода, муфты)","Доработка производится с учетом требований производителя техники, «Правил техники безопасности» и контролирующих органов самоуправления.","Материалы, входящие в стоимость Купона:","Сливной шланг до 1 м.","Концевик на модульный сливной шланг","Крепежные хомуты ","Сифон с отводом для подключения СМА и ПММ","Гибкий гофрированный выпуск к сифону","Патрубок прямой - d.40 (d.50) мм.","Ниппель для сращивания сливных шлангов d.19/d.21 мм. (пласт.)","Муфта резиновая d.50*d.73 мм.","В стоимость подключения не входит:","Выезд мастера","Подключение Аппарата","Дополнительная информация:","LAST LINE","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
  "Подключ. дораб.водоснабжения":["Доработка системы водоснабжения приобретается дополнительно к стандартной установке техники. При приобретении услуги отдельно, выезд специалиста оплачивается по действующему Прейскуранту цен на работы.","Работы входящие в стоимость:","Перфорация стен (перегородок) для прокладки коммуникаций; Монтаж водопроводного крана в водосеть клиента (один узел сантехкомплекта: кран, тройник, бочонок 1/2","Доработка производится с учетом требований производителя техники, «Правил техники безопасности» и контролирующих органов самоуправления.","Материалы, входящие в стоимость Купона:","Шланг наливной пластиковый (Италия) до 4 м","Подводка гибкая бронированная на воду","Кран","Водоотвод латунный (в сборе)","Тройник","Переходник","Муфта, бочонок.","В стоимость подключения не входит:","Выезд мастера","Подключение аппарата","Дополнительная информация:","LAST LINE","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
  "Подключ. дораб.электросети":["Доработка системы электроснабжения приобретается дополнительно к стандартной установке техники. При приобретении услуги отдельно, выезд специалиста оплачивается по действующему Прейскуранту цен на работы.","Работы входящие в стоимость:","Доработка сети электроснабжения: установка розетки с заземляющим контактом; Перфорация стен (перегородок) для прокладки коммуникаций; Прокладка электрического кабеля открытым способом (до 5 м.); Монтажные работы в электрощитке.","Доработка производится с учетом требований производителя техники, «Правил техники безопасности» и контролирующих органов самоуправления.","Материалы, входящие в стоимость Купона:","Розетка ","Вилка ","Автомат 16 А. / 2п. (отеч.)","Коробка под автомат","Провод ПВС  3*1,5 мм. (белый)","Провод МПВ 4.0 мм (белый)","Крепежные изделия пластиковые зажимы для кабеля 7-8 мм","В стоимость подключения не входит:","Выезд мастера","Подключение аппарата","Дополнительная информация:","LAST LINE","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
  "Подключ.RF (стандарт)":["Стандартное подключение холодильника: производится к уже имеющимся у Вас коммуникациям, без их доработки","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Проверка исправности и готовности к подключению к имеющимся точкам электроснабжения","Установка техники на место эксплуатации и выставление по уровню","Подключение к существующей точке электроснабжения с использованием деталей, входящих в комплект, а также с учетом требований производителей техники, «Правил техники безопасности» и контролирующих органов самоуправления, без доработки","Проверка работоспособности техники","Очистка рабочей зоны","Демонстрация работы Вашей новой техники и объяснение основных функций","Материалы, входящие в стоимость Купона:","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Выравнивание пола","Работы по изменению конфигурации шкафов или рабочих поверхностей","Встраивание техники в мебель","Перенавес дверей","Удлинение шнуров питания","Подключение холодильника к воде","Дополнительная информация:","LAST LINE","","","","","","","","","","","","","","","","","","","","","","","","",""],
  "Подключ.В\RF":["Стандартное подключение встроенного холодильника:  производится к уже имеющимся у Вас коммуникациям, без их доработки","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Проверка исправности и готовности к подключению к имеющимся точкам электроснабжения","Установка техники на место эксплуатации и выставление по уровню","Подключение к существующей точке электроснабжения с использованием деталей, входящих в комплект, а также с учетом требований производителей техники, «Правил техники безопасности» и контролирующих органов самоуправления, без доработки","Проверка работоспособности техники","Очистка рабочей зоны","Демонстрация работы Вашей новой техники и объяснение основных функций","Материалы, входящие в стоимость Купона:","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Выравнивание пола","Работы по изменению конфигурации шкафов или рабочих поверхностей","Навеска фасада на технику","Перенавес дверей","Удлинение шнуров питания","Подключение холодильника к воде","Дополнительная информация:","LAST LINE","","","","","","","","","","","","","","","","","","","","","","","","",""],
  "Подключ.RF Side-by-Side(станд)":["Стандартное подключение холодильника side-by-side: производится к уже имеющимся у Вас коммуникациям, без их доработки","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Проверка исправности и готовности к подключению к имеющимся точкам водоснабжения и электроснабжения","Сборка холодильника Side-By-Side (при необходимости)","Установка техники на место эксплуатации и выставление по уровню","Подключение к существующим точкам водо- и электроснабжения с использованием деталей, входящих в комплект, а также с учетом требований производителей техники, «Правил техники безопасности» и контролирующих органов самоуправления, без доработки","Проверка герметичности всех соединений","Проверка работоспособности техники","Очистка рабочей зоны","Демонстрация работы Вашей новой техники и объяснение основных функций","Материалы, входящие в стоимость Купона:","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Выравнивание пола и штробление стен","Работы по изменению конфигурации шкафов или рабочих поверхностей","Встраивание техники в мебель","Снятие / установка дверей холодильника","Доработка коммуникаций и удлинение шнуров питания","Дополнительная информация:","LAST LINE","","","","","","","","","","","","","","","","","","","","","","","",""],
  "Подкл.дор.RFпер.дв.без эл.дисп":["Доработка перенавес дверей холодильника (не более двух) в зависимости от  Вашего желания (дверцы без электронного управления).","Работы входящие в стоимость:","Перенавешивание дверей холодильника на левую или правую сторону по желанию клиента","Очистка рабочей зоны","Материалы, входящие в стоимость Купона:","В стоимость подключения не входит:","Выезд мастера","Работы по изменению конфигурации шкафов или рабочих поверхностей","Удлинение шнуров питания","Подключение аппарата","Дополнительная информация:","LAST LINE","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
  "Подк.дор.RF пер.дв. с эл. дисп":["Доработка перенавес дверей холодильника (не более двух) в зависимости от  Вашего желания (дверцы с  электронным управлением).","Работы входящие в стоимость:","Перенавешивание дверей холодильника на левую или правую сторону по желанию клиента","Подключение электронного управления","Проверка работоспособности техники","Очистка рабочей зоны","Материалы, входящие в стоимость Купона:","В стоимость подключения не входит:","Выезд мастера","Работы по изменению конфигурации шкафов или рабочих поверхностей","Подключение аппарата","Дополнительная информация:","LAST LINE","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
  "Подключ. Эл.плиты(стандарт)":["Стандартное подключение электрической плиты: производится к уже имеющимся у Вас силовым линиям, без их доработки.","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","Отключение и демонтаж старой плиты","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Проверка исправности и готовности к подключению к имеющейся точке электроснабжения","Установка на место дальнейшей эксплуатации  и выставление по уровню","Установка розетки 40 А","Подключение питающего кабеля к прибору с монтажом вилки 40 A","Подключение к существующей точке электроснабжения с использованием деталей, входящих в комплект, а также с учетом требований производителей техники, «Правил техники безопасности» и контролирующих органов самоуправления, без доработки","Проверка всех соединений и контактов","Проверка работоспособности техники","Очистка рабочей зоны","Демонстрация работы Вашей новой техники и объяснение основных функций","Материалы, входящие в стоимость Купона:","Розетка 40 А","вилка 40А","силовой кабель 2 м.","В стоимость подключения не входит:","Выравнивание пола","Работы по изменению конфигурации шкафов или рабочих поверхностей","Встраивание техники в мебель","Удлинение шнуров питания","Дополнительная информация:","LAST LINE","","","","","","","","","","","","","","","","","","","","",""],
  "Подключ.В\Эл.панель (незав)":["Стандартное подключение встраиваемой электрической панели:  производится к уже имеющимся у Вас силовым линиям, без их доработки.","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Проверка исправности и готовности к подключению к имеющейся точке электроснабжения","Перфорация стен (мебельных перегородок) для прокладки коммуникаций","Установка техники в мебель, на подготовленное место и выставление по уровню","Установка розетки 40 А","Подключение питающего кабеля к прибору с монтажом вилки 40 A","Подключение к существующей точке электроснабжения с использованием деталей, входящих в комплект, а также с учетом требований производителей техники, «Правил техники безопасности» и контролирующих органов самоуправления, без доработки","Проверка всех соединений и контактов","Проверка работоспособности техники","Очистка рабочей зоны","Демонстрация работы Вашей новой техники и объяснение основных функций","Материалы, входящие в стоимость Купона:","Розетка 40 А","вилка 40А","силовой кабель 2 м.","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Работы по изменению конфигурации шкафов или рабочих поверхностей","Вырез отверстия под технику и обработка спила герметиком","Удлинение шнуров питания","Дополнительная информация:","LAST LINE","","","","","","","","","","","","","","","","","","","","",""],
  "Подключ.В\Эл.шкаф (незав)":["Стандартное подключение встраиваемой электрической духовки: производится к уже имеющимся у Вас силовым линиям, без их доработки.","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Проверка исправности и готовности к подключению к имеющейся точке электроснабжения","Перфорация стен (мебельных перегородок) для прокладки коммуникаций","Установка техники в мебель, на подготовленное место и выставление по уровню","Подключение питающего кабеля к прибору с монтажом вилки 16 A","Подключение к существующей точке электроснабжения с использованием деталей, входящих в комплект, а также с учетом требований производителей техники, «Правил техники безопасности» и контролирующих органов самоуправления, без доработки","Проверка всех соединений и контактов","Проверка работоспособности техники","Очистка рабочей зоны","Демонстрация работы Вашей новой техники и объяснение основных функций.","Материалы, входящие в стоимость Купона:","Вилка ","силовой кабель 2 м","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Работы по изменению конфигурации шкафов или рабочих поверхностей","Вырез отверстия под технику и обработка спила герметиком","Удлинение шнуров питания","Перенос розеток","Дополнительная информация:","LAST LINE","","","","","","","","","","","","","","","","","","","","","",""],
  "Подключ.В\Эл.пан. и шкаф(зав)":["Стандартное подключение встраиваемой электрической панели и духовки: производится к уже имеющимся у Вас силовым линиям, без их доработки.","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Проверка исправности и готовности к подключению к имеющейся точке электроснабжения","Перфорация стен (мебельных перегородок) для прокладки коммуникаций","Установка техники в мебель, на подготовленное место и выставление по уровню","Установка розетки 40 А","Подключение питающего кабеля к прибору с монтажом вилки 40 A","Подключение к существующей точке электроснабжения с использованием деталей, входящих в комплект, а также с учетом требований производителей техники, «Правил техники безопасности» и контролирующих органов самоуправления, без доработки","Проверка всех соединений и контактов","Проверка работоспособности техники","Очистка рабочей зоны","Демонстрация работы Вашей новой техники и объяснение основных функций","Материалы, входящие в стоимость Купона:","Розетка 40 А","вилка 40А","силовой кабель 2 м.","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Работы по изменению конфигурации шкафов или рабочих поверхностей","Вырез отверстия под технику и обработка спила герметиком","Удлинение шнуров питания","Дополнительная информация:","LAST LINE","","","","","","","","","","","","","","","","","","","","",""],
  "Подключ.вытяжки (плоской)":["Стандартное подключение плоской вытяжки: производится к подготовленной точке электроснабжения, без монтажа воздухоотвода","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Проверка исправности и готовности подключения к электроснабжения","Установка техники (монтаж вытяжки на стену) на место эксплуатации","Подключение к существующей точке электроснабжения с использованием деталей, входящих в комплект, а также с учетом требований производителей техники, «Правил техники безопасности» и контролирующих органов самоуправления, без доработки","Проверка работоспособности техники","Очистка рабочей зоны","Демонстрация работы Вашей новой техники и объяснение основных функций","Материалы, входящие в стоимость Купона:","Дюбель (распорный рамный)","анкер","саморез","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Встраивание техники в мебель","обработка спила герметиком","Прокладка воздухоотводов","Подключение воздухоотвода к вытяжке","Вырез под воздуховод","Стоимость воздухоотвода","Дополнительная информация:","LAST LINE","","","","","","","","","","","","","","","","","","","","","",""],
  "Подключ.вытяжки (купольной)":["Стандартное подключение купольной вытяжки: производится к подготовленной точке электроснабжения, без монтажа воздухоотвода","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Проверка исправности и готовности подключения к электроснабжения","Установка техники (монтаж вытяжки на стену) на место эксплуатации и монтаж декоративного короба.","Подключение к существующей точке электроснабжения с использованием деталей, входящих в комплект, а также с учетом требований производителей техники, «Правил техники безопасности» и контролирующих органов самоуправления, без доработки","Проверка работоспособности техники","Очистка рабочей зоны","Демонстрация работы Вашей новой техники и объяснение основных функций.","Материалы, входящие в стоимость Купона:","Дюбель (распорный рамный)","анкер","саморез","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Встраивание техники в мебель","обработка спила герметиком","Прокладка воздухоотводов","Подключение воздухоотвода к вытяжке","Вырез под воздуховод","Стоимость воздухоотвода","Дополнительная информация:","LAST LINE","","","","","","","","","","","","","","","","","","","","","",""],
  "Подключ.В\Вытяжки":["Стандартное подключение встраиваемой вытяжки: производится к подготовленной точке электроснабжения, с встраиванием в подготовленное место, без монтажа воздухоотводов.","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Проверка исправности и готовности подключения к электроснабжения","Перфорация стен (мебельных перегородок) для прокладки коммуникаций","Установка техники в мебель, на подготовленное место","Подключение к существующей точке электроснабжения с использованием деталей, входящих в комплект, а также с учетом требований производителей техники, «Правил техники безопасности» и контролирующих органов самоуправления, без доработки","Проверка работоспособности техники","Очистка рабочей зоны","Демонстрация работы Вашей новой техники и объяснение основных функций","Материалы, входящие в стоимость Купона:","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Вырез отверстия под технику и обработка спила герметиком","Прокладка воздухоотводов","Подключение воздухоотвода к вытяжке","Вырез под воздуховод","Стоимость воздухоотвода","Дополнительная информация:","LAST LINE","","","","","","","","","","","","","","","","","","","","","","","","",""],
  "Подключ. WH проточн. элек.":["Стандартное подключение проточного водонагревателя:  производится к подготовленным точкам водо- и электроснабжения, без доработки коммуникаций.","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Проверка исправности и готовности к подключению к имеющимся точкам водоснабжения и электроснабжения","Установка (навеска) водонагревателя на место эксплуатации","Подключение к существующим точкам водо- и электроснабжения с использованием деталей, входящих в комплект, а также с учетом требований производителей техники, «Правил техники безопасности» и контролирующих органов самоуправления, без доработки","Проверка герметичности всех соединений","Проверка работоспособности техники","Очистка рабочей зоны","Демонстрация работы Вашей новой техники и объяснение основных функций","Материалы, входящие в стоимость Купона:","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Штробление стен","Работы по изменению конфигурации шкафов или рабочих поверхностей","Встраивание техники в мебель","Доработка коммуникаций и удлинение шнуров питания","Дополнительная информация:","LAST LINE","","","","","","","","","","","","","","","","","","","","","","","","","",""],
  "Подключ. WH накопит.эл(до 50л)":["Стандартное подключение водонагревателя до 50 л.: производится к подготовленным точкам водо- и электроснабжения и системе стационарного слива, без доработки коммуникаций.","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Проверка исправности и готовности к подключению к имеющимся точкам водоснабжения, электроснабжения и системе слива","Установка (навеска) водонагревателя на место эксплуатации","Подключение к существующим точкам водо-, электроснабжения и системе стационарного слива с использованием деталей, входящих в комплект, а также с учетом требований производителей техники, «Правил техники безопасности» и контролирующих органов самоуправления, без доработки","Проверка герметичности всех соединений","Проверка работоспособности техники","Очистка рабочей зоны","Демонстрация работы Вашей новой техники и объяснение основных функций.","Материалы, входящие в стоимость Купона:","Дюбель (распорный рамный)","анкер","саморез","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Штробление стен","Работы по изменению конфигурации шкафов или рабочих поверхностей","Встраивание техники в мебель","Доработка коммуникаций и удлинение шнуров питания","Дополнительная информация:","LAST LINE","","","","","","","","","","","","","","","","","","","","","","",""],
  "Подключ. WH накопит.эл(от 51л)":["Стандартное подключение водонагревателя от 51 л.: производится к подготовленным точкам водо- и электроснабжения и системе стационарного слива, без доработки коммуникаций.","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Проверка исправности и готовности к подключению к имеющимся точкам водоснабжения, электроснабжения и системе слива","Установка (навеска) водонагревателя на место эксплуатации","Подключение к существующим точкам водо-, электроснабжения и системе стационарного слива с использованием деталей, входящих в комплект, а также с учетом требований производителей техники, «Правил техники безопасности» и контролирующих органов самоуправления, без доработки","Проверка герметичности всех соединений","Проверка работоспособности техники","Очистка рабочей зоны","Демонстрация работы Вашей новой техники и объяснение основных функций.","Материалы, входящие в стоимость Купона:","Дюбель (распорный рамный)","анкер","саморез","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Штробление стен","Работы по изменению конфигурации шкафов или рабочих поверхностей","Встраивание техники в мебель","Доработка коммуникаций и удлинение шнуров питания","Дополнительная информация:","LAST LINE","","","","","","","","","","","","","","","","","","","","","","",""],
  "Подключ.кондиц. (7000-9000)":["Стандартное подключение сплит-системы, состоящей из  наружного и одного внутреннего блока мощностью охлаждения до 2,5 кВт (7 000 – 9 000 BTU/h)","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Установка техники на место эксплуатации и выставление по уровню","Бурение одного отверстия в наружной стене помещения (здания) под соединительный комплект, связывающий внутренний и наружные блоки системы.","Монтаж стандартного кронштейна (1 компл.), при условии возможности монтажа и подключения наружного блока без  применения специальной техники.","Монтаж наружного и внутреннего блоков.","Прокладка фреоновой трассы (до 3  м.).","Монтаж декоративного короба под фреоновую трассу внутри помещения (до 1 м.).","Монтаж декоративного короба (до 1,5 м.) под электропроводу","Подключение внутреннего блока к существующей точке электроснабжения (удаленность розетки до 1,5 м.) с учетом требований производителей техники, «Правил техники безопасности» и контролирующих органов самоуправления, без доработки","Герметизация наружного отверстия","Пуско-наладочные работы, проверка работоспособности","Очистка рабочей зоны","Демонстрация работы Вашей новой техники и объяснение основных функций","Материалы, входящие в стоимость Купона:","Вилка ","Труба медная (1/4","Теплоизоляция флекс ( 6*6 мм. до 3м., 10*6 мм. до 3м);  Кронштейн - 1компл.;  ","Короб декоративный пластиковый:  20*10 мм. до 2м , 65*50 мм. до 1м.;  ","Провод ПВС: 3*1,5 мм.кв. до 2м ,   5*1,5 мм.кв. до 5м.) ","Дюбель KPR 10*100 (распорный рамный) + анкер - 4шт.;  ","Труба дренажная 16 мм. – до 3 м.;  ","Трубка пластиковая 16 мм. - 1м.;  ","Изолента чёрная - 1м.; ","Лента TPL армированная монтажная 50 мм. – до 0,5рул.;  ","Пена монтажная – до 0,5 бал.","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Штробление стен","Работы по изменению конфигурации  рабочих поверхностей.","Удлинение шнуров питания","Перенос розеток","Применение дополнительного оборудования и дополнительных работ,  связанных с вызовом альпиниста,  автовышки и т.д.","Дополнительная информация:","Если потребляемая мощность устанавливаемого прибора превышает допустимую мощность для внутриквартирных электрических  сетей, исполнитель оставляет за собой право не производить подключение к электрическим  сетям до получения клиентом разрешения от поставщика электроэнегии или прокладки отдельной электросети необходимой для подключения кондиционера.","Получение разрешений по установке кондиционера, а также согласование с местными органами самоуправления производятся Клиентом самостоятельно.","Установка кондиционера  производится при температуре выше 0 градусов. Запуск аппарата производится по правилам и при температуре установленными  производителем.","LAST LINE","","","","","",""],
  "Подключ.кондиц. (12000-16000)":["Стандартное подключение сплит-системы, состоящей из наружного и одного внутреннего блока мощностью охлаждения до 5,0 кВт (12 000 -16 000 BTU/h)","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы). ","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Установка техники на место эксплуатации и выставление по уровню","Бурение одного отверстия в наружной стене помещения (здания) под соединительный комплект, соединяющий внутренний и наружный блоки системы.","Монтаж  кронштейна (1 компл.) для установки наружного блока  в доступном месте и подключения наружного блока без  применения специальной техники","Монтаж наружного и внутреннего блоков","Прокладка фреоновой трассы (до 3 м.).","Монтаж декоративного короба под фреоновую трассу внутри помещения (до 1 м.).","Монтаж декоративного короба (до 1,5 м.) под электропровод.","Подключение внутреннего блока к существующей точке электроснабжения (удаленность розетки до 1,5 м.) с учетом требований производителей техники, «Правил техники безопасности» и контролирующих органов самоуправления, без доработки","Герметизация наружного отверстия","Пуско-наладочные работы, проверка работоспособности","Очистка рабочей зоны ","Демонстрация работы Вашей новой техники и объяснение основных функций.","Материалы, входящие в стоимость Купона:","Вилка ","Труба медная (1/4","Теплоизоляция флекс ( 6*6 мм. до 3м., 10*6 мм. до 3м);  Кронштейн - 1компл.;  ","Короб декоративный пластиковый:  20*10 мм. до 2м , 65*50 мм. до 1м.;  ","Провод ПВС: 3*1,5 мм.кв. до 2м ,   5*1,5 мм.кв. до 5м.) ","Дюбель KPR 10*100 (распорный рамный) + анкер - 4шт.;  ","Труба дренажная 16 мм. – до 3 м.;  ","Трубка пластиковая 16 мм. - 1м.;  ","Изолента чёрная - 1м.; ","Лента TPL армированная монтажная 50 мм. – до 0,5рул.;  ","Пена монтажная – до 0,5 бал.","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Штробление стен","Работы по изменению конфигурации  рабочих поверхностей.","Удлинение шнуров питания","Перенос розеток","Применение дополнительного оборудования и дополнительных работ, связанных с вызовом альпиниста, автовышки и т.д.","Дополнительная информация:","Если потребляемая мощность устанавливаемого прибора превышает допустимую мощность для внутриквартирных электрических  сетей, исполнитель оставляет за собой право не производить подключение к электрическим  сетям до получения клиентом разрешения от поставщика электроэнегии или прокладки отдельной электросети необходимой для подключения кондиционера.","Получение разрешений по установке кондиционера, а также согласование с местными органами самоуправления производятся Клиентом самостоятельно.","Установка кондиционера  производится при температуре выше 0 градусов. Запуск аппарата производится по правилам и при температуре установленными  производителем.","LAST LINE","","","","","",""],
  "Подключ.кондиц. (18000-24000)":["Стандартное подключение сплит-системы, состоящей из наружного и одного внутреннего блока мощностью охлаждения  до 7,0 кВт (18 000 – 24 000 BTU/h)","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Установка техники на место эксплуатации и выставление по уровню","Бурение одного отверстия в наружной стене помещения (здания) под соединительный комплект, соединяющий внутренний и наружный блоки системы.","Монтаж  кронштейна (1 компл.) для установки наружного блока  в доступном месте и подключения наружного блока без  применения специальной техники","Монтаж наружного и внутреннего блоков","Прокладка фреоновой трассы (до 3 м.).","Монтаж декоративного короба под фреоновую трассу внутри помещения (до 1 м.).","Монтаж декоративного короба (до 1,5 м.) под электропровод","Подключение внутреннего блока к существующей точке электроснабжения (удаленность розетки до 1,5 м.) с учетом требований производителей техники, «Правил техники безопасности» и контролирующих органов самоуправления, без доработки","Герметизация наружного отверстия","Пуско-наладочные работы, проверка работоспособности.","Очистка рабочей зоны ","Демонстрация работы Вашей новой техники и объяснение основных функций.","Материалы, входящие в стоимость Купона:","Вилка ","Труба медная (1/4","Теплоизоляция флекс ( 6*6 мм. до 3м., 10*6 мм. до 3м);  Кронштейн - 1компл.;  ","Короб декоративный пластиковый:  20*10 мм. до 2м , 65*50 мм. до 1м.;  ","Провод ПВС: 3*1,5 мм.кв. до 2м ,   5*1,5 мм.кв. до 5м.) ","Дюбель KPR 10*100 (распорный рамный) + анкер - 4шт.;  ","Труба дренажная 16 мм. – до 3 м.;  ","Трубка пластиковая 16 мм. - 1м.;  ","Изолента чёрная - 1м.; ","Лента TPL армированная монтажная 50 мм. – до 0,5рул.;  ","Пена монтажная – до 0,5 бал.","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Штробление стен","Работы по изменению конфигурации  рабочих поверхностей.","Удлинение шнуров питания","Перенос розеток","Применение дополнительного оборудования и дополнительных работ, связанных с вызовом альпиниста, автовышки и т.д.","Дополнительная информация:","Если потребляемая мощность устанавливаемого прибора превышает допустимую мощность для внутриквартирных электрических  сетей, исполнитель оставляет за собой право не производить подключение к электрическим  сетям до получения клиентом разрешения от поставщика электроэнегии или прокладки отдельной электросети необходимой для подключения кондиционера.","Получение разрешений по установке кондиционера, а также согласование с местными органами самоуправления производятся Клиентом самостоятельно.","Установка кондиционера  производится при температуре выше 0 градусов. Запуск аппарата производится по правилам и при температуре установленными  производителем.","LAST LINE","","","","","",""],
  "Подкл.демонтаж AC(7000-9000)":["Стандартный демонтаж сплит-системы, состоящей из одного наружного и одного внутреннего блока мощностью охлаждения до 2,5 кВт (7 000 – 9 000 BTU/h) с длиной трассы не более 4 метров ","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы). ","Осмотр оборудования и проверка его работоспособности (в случае если кондиционер исправен и планируется его перемещение в другое место - сбор хладагента) ","Консультация по вопросам эксплуатации","Демонтаж кронштейнов, при необходимости (в доступном месте, без применения специальной техники)","Демонтаж пластикового короба 1 метр (в случае необходимости)","Демонтаж  системы (блоков и трассы, проложенной открытым способом)","Очистка рабочей зоны ","Материалы, входящие в стоимость Купона:","В стоимость подключения не входит:","Штробление/вскрытие стен","Применение дополнительного оборудования и дополнительных работ, связанных с вызовом альпиниста, Автовышки и т.д.","Герметизация межпанельных отверстий","Дополнительная информация:","Демонтаж кондиционера производится при температуре выше  0 градусов. Запуск аппарата, когда требуется проверка работоспособности для дальнейшей эксплуатации производится по правилам и при температуре установленными  производителем.","В случае если тебуется демонтаж мультисплит системы или длина трассы демонтируемой техники превышает 4 метра, доплата производится согласно действующему Прейскуранту цен на допработы за каждый отдельный внутренний блок и метр трассы)","Работы, связанные с демонтажем системы, не вошедшие в  данное описание, оплачиваются отдельно по прейскуранту дополнительных работ","LAST LINE","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
  "Подкл.демонтаж AC(12000-16000)":["Стандартный демонтаж сплит-системы, состоящей из одного наружного и одного внутреннего блока мощностью охлаждения до 5,0 кВт (12 000 -16 000 BTU/h) с длиной трассы не более 4 метров ","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы). ","Осмотр оборудования и проверка его работоспособности (в случае если кондиционер исправен и планируется его перемещение в другое место - сбор хладагента) ","Консультация по вопросам эксплуатации","Демонтаж кронштейнов, при необходимости (в доступном месте, без применения специальной техники)","Демонтаж пластикового короба 1 метр (в случае необходимости)","Демонтаж  системы (блоков и трассы, проложенной открытым способом)","Очистка рабочей зоны ","Материалы, входящие в стоимость Купона:","В стоимость подключения не входит:","Штробление/вскрытие стен","Применение дополнительного оборудования и дополнительных работ, связанных с вызовом альпиниста, Автовышки и т.д.","Герметизация межпанельных отверстий","Дополнительная информация:","Демонтаж кондиционера производится при температуре выше  0 градусов. Запуск аппарата, когда требуется проверка работоспособности для дальнейшей эксплуатации производится по правилам и при температуре установленными  производителем.","В случае если тебуется демонтаж мультисплит системы или длина трассы демонтируемой техники превышает 4 метра, доплата производится согласно действующему Прейскуранту цен на допработы за каждый отдельный внутренний блок и метр трассы)","Работы, связанные с демонтажем системы, не вошедшие в  данное описание, оплачиваются отдельно по прейскуранту дополнительных работ","LAST LINE","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
  "Подкл.демонтаж AC(18000-24000)":["Стандартный демонтаж сплит-системы, состоящей из одного наружного и одного внутреннего блока мощностью охлаждения  до 7,0 кВт (18 000 – 24 000 BTU/h) с длиной трассы не более 4 метров ","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы). ","Осмотр оборудования и проверка его работоспособности (в случае если кондиционер исправен и планируется его перемещение в другое место - сбор хладагента) ","Консультация по вопросам эксплуатации","Демонтаж кронштейнов, при необходимости (в доступном месте, без применения специальной техники)","Демонтаж пластикового короба 1 метр (в случае необходимости)","Демонтаж  системы (блоков и трассы, проложенной открытым способом)","Очистка рабочей зоны ","Материалы, входящие в стоимость Купона:","В стоимость подключения не входит:","Штробление/вскрытие стен","Применение дополнительного оборудования и дополнительных работ, связанных с вызовом альпиниста, Автовышки и т.д.","Герметизация межпанельных отверстий","Дополнительная информация:","Демонтаж кондиционера производится при температуре выше  0 градусов. Запуск аппарата, когда требуется проверка работоспособности для дальнейшей эксплуатации производится по правилам и при температуре установленными  производителем.","В случае если тебуется демонтаж мультисплит системы или длина трассы демонтируемой техники превышает 4 метра, доплата производится согласно действующему Прейскуранту цен на допработы за каждый отдельный внутренний блок и метр трассы)","Работы, связанные с демонтажем системы, не вошедшие в  данное описание, оплачиваются отдельно по прейскуранту дополнительных работ","LAST LINE","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
  "Подкл. Обслуж.кондиц.(станд)":["Стандартное обслуживание сплит-системы, состоящей из одного наружного и одного внутреннего блока.","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","Осмотр оборудования и проверка на правильность его установки и эксплуатации (надежность крепления блоков, проверка контактов электрических соединений)","Консультация по вопросам эксплуатации","Чистка и мойка внешнего блока (в доступном месте).","Частичная разборка внутреннего и внешнего блока (в доступном месте)","Чистка многоразовых фильтров, сетки, крыльчатки внутреннего блока","Чистка дренажной системы, проверка её работы","Проверка рабочего давления в системе прохождения хладагента (в случае необходимости  возможна дозаправка, оплата производится по прейскуранту цен на допработы в соответствии с мощностью и системой мульти)","Проверка работы  системы кондиционирования на охлаждение и обогрев (при наличии функции обогрева)","Очистка рабочей зоны ","Материалы, входящие в стоимость Купона:","В стоимость подключения не входит:","Штробление/вскрытие стен","Работы по изменению конфигурации  рабочих поверхностей.","Удлинение шнуров питания","Перенос розеток","Применение дополнительного оборудования и дополнительных работ, связанных с вызовом альпиниста, автовышки и т.д.","Дополнительная информация:","Обслуживание и запуск аппарата производится по правилам и при температуре установленными  производителем.","LAST LINE","","","","","","","","","","","","","","","","","","","","","","","","",""],
  "Подкл. ТВ до 32":["Стандартное подключение телевизора, то есть установка телевизора на тумбу, стойку, подставку и его настройку.","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Установка техники на тумбу, стойку, подставку","Подключение телевизора к эфирной антенне","Настройка и сортировка телевизионных каналов","Подключение и настройка телевизора к одному из источников аудио-видео сигнала (спутниковая антенна, кабельное ТВ, DVD, VCR, ресивер и т.д.)","Проверка работоспособности техники","Очистка рабочей зоны","Демонстрация работы Вашей новой техники и объяснение основных функций.","Материалы, входящие в стоимость Купона:","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Работа по сборке мебели или изменению её конфигурации","Встраивание техники в мебель","Установка напольной подставки","Аксессуары и материалы (сетевой фильтр, кабели, крепежные элементы)","Настройка аудио-видео или другого оборудования.","Дополнительная информация:","LAST LINE","","","","","","","","","","","","","","","","","","","","","","","","",""],
  "Подкл. ТВ до 46":["Стандартное подключение телевизора, то есть установка телевизора на тумбу, стойку, подставку и его настройку.","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Установка техники на тумбу, стойку, подставку","Подключение телевизора к эфирной антенне","Настройка и сортировка телевизионных каналов","Подключение и настройка телевизора к одному из источников аудио-видео сигнала (спутниковая антенна, кабельное ТВ, DVD, VCR, ресивер и т.д.)","Проверка работоспособности техники","Очистка рабочей зоны","Демонстрация работы Вашей новой техники и объяснение основных функций.","Материалы, входящие в стоимость Купона:","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Работа по сборке мебели или изменению её конфигурации","Встраивание техники в мебель","Установка напольной подставки","Аксессуары и материалы (сетевой фильтр, кабели, крепежные элементы)","Настройка аудио-видео или другого оборудования.","Дополнительная информация:","LAST LINE","","","","","","","","","","","","","","","","","","","","","","","","",""],
  "Подкл. ТВ свыше 46":["Стандартное подключение телевизора, то есть установка телевизора на тумбу, стойку, подставку и его настройку.","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Установка техники на тумбу, стойку, подставку","Подключение телевизора к эфирной антенне","Настройка и сортировка телевизионных каналов","Подключение и настройка телевизора к одному из источников аудио-видео сигнала (спутниковая антенна, кабельное ТВ, DVD, VCR, ресивер и т.д.)","Проверка работоспособности техники","Очистка рабочей зоны ","Демонстрация работы Вашей новой техники и объяснение основных функций.","Материалы, входящие в стоимость Купона:","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Работа по сборке мебели или изменению её конфигурации","Встраивание техники в мебель","Установка напольной подставки","Аксессуары и материалы (сетевой фильтр, кабели, крепежные элементы)","Настройка аудио-видео или другого оборудования.","Дополнительная информация:","LAST LINE","","","","","","","","","","","","","","","","","","","","","","","","",""],
  "Подкл. ТВ свыше 65":["Стандартное подключение телевизора, то есть установка телевизора на тумбу, стойку, подставку и его настройку.","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Установка техники на тумбу, стойку, подставку","Подключение телевизора к эфирной антенне","Настройка и сортировка телевизионных каналов","Подключение и настройка телевизора к одному из источников аудио-видео сигнала (спутниковая антенна, кабельное ТВ, DVD, VCR, ресивер и т.д.)","Проверка работоспособности техники","Очистка рабочей зоны","Демонстрация работы Вашей новой техники и объяснение основных функций.","Материалы, входящие в стоимость Купона:","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Работа по сборке мебели или изменению её конфигурации","Встраивание техники в мебель","Установка напольной подставки","Аксессуары и материалы (сетевой фильтр, кабели, крепежные элементы)","Настройка аудио-видео или другого оборудования.","Дополнительная информация:","LAST LINE","","","","","","","","","","","","","","","","","","","","","","","","",""],
  "Подкл. ТВ до 32":["Стандартное подключение телевизора, то есть навеска телевизора на стену (на не моторизированный подвес) и его настройку.","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Монтаж подвеса на стену (на высоту до 2 метров по центру экрана телевизора) и крепление телевизора к подвесу","Подключение телевизора к эфирной антенне","Настройка и сортировка телевизионных каналов","Подключение и настройка телевизора к одному из источников аудио-видео сигнала (спутниковая антенна, кабельное ТВ, DVD, VCR, ресивер и т.д.)","Проверка работоспособности техники","Очистка рабочей зоны","Демонстрация работы Вашей новой техники и объяснение основных функций.","Материалы, входящие в стоимость Купона:","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Работа по сборке мебели или изменению ее конфигурации","Встраивание техники в мебель","Установка напольной подставки","Аксессуары и материалы (сетевой фильтр, подвесы, кабели, крепежные элементы)","Настройка аудио-видео или другого оборудования.","Дополнительная информация:","LAST LINE","","","","","","","","","","","","","","","","","","","","","","","","",""],
  "Подкл. ТВ до 46":["Стандартное подключение телевизора, то есть навеска телевизора на стену (на не моторизированный подвес) и его настройку.","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Монтаж подвеса на стену (на высоту до 2 метров по центру экрана телевизора) и крепление телевизора к подвесу","Подключение телевизора к эфирной антенне","Настройка и сортировка телевизионных каналов","Подключение и настройка телевизора к одному из источников аудио-видео сигнала (спутниковая антенна, кабельное ТВ, DVD, VCR, ресивер и т.д.)","Проверка работоспособности техники","Очистка рабочей зоны","Демонстрация работы Вашей новой техники и объяснение основных функций","Материалы, входящие в стоимость Купона:","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Работа по сборке мебели или изменению ее конфигурации","Встраивание техники в мебель","Установка напольной подставки","Аксессуары и материалы (сетевой фильтр, подвесы, кабели, крепежные элементы)","Настройка аудио-видео или другого оборудования.","Дополнительная информация:","LAST LINE","","","","","","","","","","","","","","","","","","","","","","","","",""],
  "Подкл. ТВ свыше 46":["Стандартное подключение телевизора, то есть навеска телевизора на стену (на не моторизированный подвес) и его настройку.","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Монтаж подвеса на стену (на высоту до 2 метров по центру экрана телевизора) и крепление телевизора к подвесу","Подключение телевизора к эфирной антенне","Настройка и сортировка телевизионных каналов","Подключение и настройка телевизора к одному из источников аудио-видео сигнала (спутниковая антенна, кабельное ТВ, DVD, VCR, ресивер и т.д.);","Проверка работоспособности техники","Очистка рабочей зоны","Демонстрация работы Вашей новой техники и объяснение основных функций","Материалы, входящие в стоимость Купона:","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Работа по сборке мебели или изменению ее конфигурации","Встраивание техники в мебель","Установка напольной подставки","Аксессуары и материалы (сетевой фильтр, подвесы, кабели, крепежные элементы)","Настройка аудио-видео или другого оборудования.","Дополнительная информация:","LAST LINE","","","","","","","","","","","","","","","","","","","","","","","","",""],
  "Подкл. ТВ свыше 65":["Стандартное подключение телевизора, то есть навеска телевизора на стену (на не моторизированный подвес) и его настройку.","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Монтаж подвеса на стену (на высоту до 1.7 метров по центру экрана телевизора) и крепление телевизора к подвесу","Подключение телевизора к эфирной антенне","Настройка и сортировка телевизионных каналов","Подключение и настройка телевизора к одному из источников аудио-видео сигнала (спутниковая антенна, кабельное ТВ, DVD, VCR, ресивер и т.д.)","Проверка работоспособности техники","Очистка рабочей зоны ","Демонстрация работы Вашей новой техники и объяснение основных функций.","Материалы, входящие в стоимость Купона:","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Работа по сборке мебели или изменению ее конфигурации","Встраивание техники в мебель","Установка напольной подставки","Аксессуары и материалы (сетевой фильтр, подвесы, кабели, крепежные элементы)","Настройка аудио-видео или другого оборудования.","Дополнительная информация:","LAST LINE","","","","","","","","","","","","","","","","","","","","","","","","",""],
  "Дораб. SMART +":["Стандартное подключение ранее установленного (подвешенного) Smart Телевизора к сети Интернет, его настройку, и настройку дополнительных устройств.","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","Консультация по вопросам эксплуатации","Восстановление (подключение и настройка) всех предыдущих проводных AV подключений Клиента любого количества (DVD, Blu Ray, Receiver, NAV SAT, XB360, PS3, Nintendo Wii и т.д.), которое позволяет количество интерфейсов SMTV , способ подключения открытый в жгутах.","Проверка работоспособности Интернета.","Установка и настройка роутера (в том числе нового, при условии, что Клиент/провайдер готов предоставить необходимые настройки)","Подключение  и настройка SMTV к сети Интернет через роутер по wi-fi:","При необходимости, Клиент может подключить SMTV по проводу через витую пару, коннектор RJ-45. Стоимость по прейскуранту СЦ с учетом обжимки и коннекторов – оплачивается отдельно.","В случае, если SMTV не обладает wi-fi модулем, Клиент все равно может подключить TV по wi-fi, в случае, если приобретет одно из двух устройств: usb wi-fi stick, RJ-45 – wi-fi (оба устройства продаются в магазинах, необходимо уточнять совместимость устройств у продавцов).","Подключение к  Router до 5-ти устройств Wi-Fi:","Ноутбук, моноблок, системный блок (PC)  (подключение по DLNA, обладают все устройства PC)","Ноутбук, моноблок (Mac) (подключение при помощи специальной платной утилиты)","Wi-Fi/Enternet Принтер/МФУ ","iOS Устройство (iPod, iPad, iPhone) (подключение при помощи специальной платной утилиты)","Android Устройство (коммуникатор или планшет)","другой SMTV   (подключение исключительно к роутеру, при возможности к NAS)","Wi-Fi/Enternet Медиаплеер (подключение к роутеру, при возможности к NAS)","NAS (подключение в сеть, объединение с устройствами Клиента, минимум SMTV + PC,при наличии совместимого программного обеспечения)","Wi-Fi/ Enternet  Игровая приставка  (если было только подключение к ТВ, то мастер может по желанию Клиента подключить через роутер к интернету)","Проверка коректной работы всех произведенных настроек.","Очистка рабочей зоны","Демонстрация работы Вашей новой техники и объяснение основных функций. ","Материалы, входящие в стоимость Купона:","В стоимость подключения не входит:","Работа по сборке мебели или изменению её конфигурации","Установка напольной подставки","Аксессуары и материалы (сетевой фильтр, кабели, крепежные элементы). ","Дополнительная информация:","Скачивание  дополнительных программных утилит, не входящих в комплект, для коммуникации устройств. Скорость обновления устройств зависит от скорости интернета.","LAST LINE","","","","","","","","","","","","","","","",""],
  "Подкл. Дом.кинот.1 кор.(уст.)":["Стандартное подключение «домашнего кинотеатра в одной коробке», то есть установка и подключение сабвуфера, AV–ресивера,  комплекта акустических систем (до 5 единиц) и настройка. Подключение производится аксессуарами, входящими в комплект поставки или приобретенными дополнительно.","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Прокладка кабеля открытым способом, организация кабелей в жгуты","Настройка «домашнего кинотеатра с использованием устройств одного комплекта»","Установка, сборка и подключение комплекта акустических систем (до 5 единиц) + 1 активного сабвуфера","Подключение AV-ресивера к  телевизору или видеопроектору","Проверка работоспособности техники","Очистка рабочей зоны ","Демонстрация работы Вашей новой техники и объяснение основных функций","Материалы, входящие в стоимость Купона:","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Работа по сборке мебели или изменению её конфигурации","Работа по маскировке кабелей","Настройка другого оборудования не входящего в комплект кинотеатра."," Аксессуары и материалы (сетевой фильтр, тройники, переходники, подвесы, АV-мебель, кабели, крепежные элементы)","Настройка аудио-видео или другого оборудования.","Дополнительная информация:","LAST LINE","","","","","","","","","","","","","","","","","","","","","","","","",""],
  "Подкл. Дом.кинот.1 кор.(подв.)":["Стандартное подключение «домашнего кинотеатра в одной коробке» с навеской акустических систем, то есть установка и подключение сабвуфера, AV–ресивера,  навеска на стену и подключение комплекта акустических систем (до 5 единиц) и настройка. Подключение производится аксессуарами, входящими в комплект поставки или приобретенными дополнительно.","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Прокладка кабеля открытым способом, организация кабелей в жгуты","Настройка «домашнего кинотеатра с использованием устройств одного комплекта»","Установка, сборка и подключение комплекта акустических систем (до 5 единиц) + 1 активного сабвуфера","Подключение AV-ресивера к  телевизору или видеопроектору","Проверка работоспособности техники","Очистка рабочей зоны ","Демонстрация работы Вашей новой техники и объяснение основных функций","Материалы, входящие в стоимость Купона:","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Работа по сборке мебели или изменению её конфигурации","Работа по маскировке кабелей","Настройка другого оборудования не входящего в комплект кинотеатра.","Аксессуары и материалы (сетевой фильтр, тройники, переходники, подвесы, кабели, крепежные элементы)","Настройка аудио-видео или другого оборудования.","Дополнительная информация:","LAST LINE","","","","","","","","","","","","","","","","","","","","","","","","",""],
  "Подкл. тестиров. спутн. сигн.":["Услуга по проверке различных вариантов монтажа антенны для возможности приема спутникового сигнала.","Работы входящие в стоимость:","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","Тестирование возможности принятия спутникового сигнала на фасаде здания (на балконе, за окном)  или на крыше здания","Очистка рабочей зоны ","Материалы, входящие в стоимость Купона:","В стоимость подключения не входит:","Работа по установке антенны, ее подключению и активация Договора","Работа по установке антенны, ее подключению и активация Договора","Дополнительная информация:","Организация доступа к месту предполагаемой установки производится клиентом самостоятельно","О наличии аксессуаров и материалов в комплекте Вашей спутниковой антенны можно узнать в магазине и, при необходимости, приобрести","LAST LINE","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
  "Подкл. спутн.тел.(d до 0.79м)":["Стандартное подключение спутникового телевидения с диаметром тарелки до 0.79 м. после проведения тестирования.","Работы входящие в стоимость:","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Перфорация уличной стены (перегородки) для прокладки кабеля","Установка спутниковой антенны диаметром до 0.79 м. в легкодоступном месте","Заполнение и регистрация договора системы спутникового телевидения","Подключение  кабеля к конвертору и цифровому терминалу","Настройка цифрового терминала","Подключение цифрового терминала к 1 ресиверу, телевизору","Подключение  кабеля к конвертору и цифровому терминалу","Настройка цифрового терминала","Подключение цифрового терминала к 1 ресиверу, телевизору (внезависимости от количества ресиверов в комплекте). ","Проверка работоспособности техники","Очистка рабочей зоны ","Демонстрация работы Вашей новой техники и объяснение основных функций","Материалы, входящие в стоимость Купона:","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Штробление стен","Выезд мастера и тестирование сигнала","Применение дополнительного оборудования и дополнительных работ, связанных с вызовом альпиниста,  автовышки, установки лесов и т.д.","Аксессуары и материалы (сетевой фильтр, крепежные элементы)","Настройка аудио-видео или  другого оборудования; Установка нестандартных и моторизованных  кронштейнов для тарелки, мачт.","Дополнительная информация:","Получение разрешений по установке спутниковой антенны  на фасаде или крыше здания, а так же организация доступа к месту установки производится клиентом самостоятельно.","Произвести проверку работоспособности оборудования и его настройку, возможно только при активации Договора провайдером. Так как срок  активации зависит только от провайдера, рекомендуется производить регистрацию договора до выезда специалиста.","При необходимости дополнительных работ и использования дополнительных материалов, стоимость  согласовывается с Клиентом на месте.","Монтаж производится с применением  аксессуаров входящих в комплект Вашего оборудования.","О наличии аксессуаров и материалов в комплекте Вашей спутниковой антенны можно узнать в магазине и, при необходимости, приобрести.","LAST LINE","","","","","","","","","","","","","","","",""],
  "Подкл. спутн.тел.(d от 0.8м)":["Стандартное подключение спутникового телевидения с диаметром тарелки свыше 0,8 м. после проведения тестирования.","Работы входящие в стоимость:","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Перфорация уличной стены (перегородки) для прокладки кабеля","Установка спутниковой антенны диаметром свыше 0,8 м. в легкодоступном месте","Заполнение и регистрация договора системы спутникового телевидения","Прокладка кабеля открытым способом (до 9 м.)","Подключение  кабеля к конвертору и цифровому терминалу","Настройка цифрового терминала","Подключение цифрового терминала к 1 ресиверу, телевизору","Подключение  кабеля к конвертору и цифровому терминалу","Настройка цифрового терминала","Подключение цифрового терминала к 1 ресиверу, телевизору (внезависимости от количества ресиверов в комплекте). ","Проверка работоспособности техники","Очистка рабочей зоны ","Демонстрация работы Вашей новой техники и объяснение основных функций","Материалы, входящие в стоимость Купона:","В стоимость подключения не входит:","Отключение и демонтаж старой техники","Штробление стен","Выезд мастера и тестирование сигнала","Применение дополнительного оборудования и дополнительных работ,  связанных с вызовом альпиниста,  автовышки, установки лесов и т.д.","Аксессуары и материалы (сетевой фильтр, крепежные элементы)","Настройка аудио-видео или  другого оборудования; Установка нестандартных и моторизованных  кронштейнов для тарелки, мачт.","Дополнительная информация:","Получение разрешений по установке спутниковой антенны  на фасаде или крыше здания, а так же организация доступа к месту установки производится клиентом самостоятельно.","Произвести проверку работоспособности оборудования и его настройку, возможно только при активации Договора провайдером. Так как срок  активации зависит только от провайдера, рекомендуется производить регистрацию договора до выезда специалиста.","При необходимости дополнительных работ и использования дополнительных материалов, стоимость  согласовывается с Клиентом на месте.","Монтаж производится с применением  аксессуаров входящих в комплект Вашего оборудования.","О наличии аксессуаров и материалов в комплекте Вашей спутниковой антенны можно узнать в магазине и, при необходимости, приобрести.","LAST LINE","","","","","","","","","","","","","","",""]
}
function getWorks (id) {
  
  console.log ('id: '+id);
  var worksArr = '';

  let begin = bigDictionary[id].indexOf('Работы входящие в стоимость:') + 1;
  let end = bigDictionary[id].indexOf('Материалы, входящие в стоимость Купона:') - 1; 
  worksArr = bigDictionary[id].slice(begin, end);
  
  return worksArr;
}

function getMaterials (id) {
  let materials = [];

  let begin = bigDictionary[id].indexOf('Материалы, входящие в стоимость Купона:') + 1;
  let end = bigDictionary[id].indexOf('В стоимость подключения не входит:') - 1; 
  materials = bigDictionary[id].slice(begin, end).filter( function (item) {
    return Boolean(item)
  }).map(function(item,i) { 
    console.log(item);
    return ' ' + item
    });

  return materials

}

function worksNotInclude(id) {

  let works = [];
  
  let begin = bigDictionary[id].indexOf('В стоимость подключения не входит:') + 1;
  let end = bigDictionary[id].indexOf('Дополнительная информация:') - 1; 
  works = bigDictionary[id].slice(begin, end).filter( function (item) {
    return Boolean(item)
  }).map(function(item,i) { 
    console.log(item);
    return ' ' + item
    });

  return works
}

function returnSpacesUnderline (number,fullname) {
  let spacesUnderline = '';
  for (var i = 1; i < number; i++) {
    spacesUnderline +=' ';
    
  }
  return fullname ? fullname : { text: spacesUnderline, decoration: 'underline' } 
}

function getInfoText(id) {
  return bigDictionary[id][0]
}

function getAdditionalInfo(id) {
  let additionalInfo = ''
  let begin = bigDictionary[id].indexOf('Дополнительная информация:') + 1;
  let end = bigDictionary[id].indexOf('LAST LINE') - 1; 

  additionalInfo = bigDictionary[id].slice(begin,end);

  return additionalInfo;

}  



export let getNewDefinition = function (orderObj) {

  

  let infoText = getInfoText(orderObj.row.productFullName);
  let productFullName = orderObj.row.productFullName;
  let customerFullName = returnSpacesUnderline(100, orderObj.row.customerFullName) ;
  let couponNumber = orderObj.row.couponNumber;
  let worksInCoupon = getWorks(orderObj.row.productFullName);
  let materialsInCoupon = getMaterials (orderObj.row.productFullName);
  let worksNotIncludeInCoupon = worksNotInclude(orderObj.row.productFullName);
  let additionalInfo = getAdditionalInfo(orderObj.row.productFullName);
  let dateValue = orderObj.row.masterWorkDate;
  let payDate = orderObj.row.payPayDate;

  let couponDocDefinition = {
    pageSize: 'A4',
    pageOrientation: 'landscape',
    pageMargins: [5, 5, 5, 5],

    info: {
      title: 'Купон на установку {{couponNumber}}',
      author: '{{username}}',
      subject: '{{productFullName}}',
      keywords: '',
    },




    content: [

      {
        table: {

          widths: ['*', '*'],
          body: [
            [
              { text: 'Левая часть остается у мастера', style: 'headerInfo', border: [false, false, true, true] },
              { text: 'Правая часть остается у мастера', style: 'headerInfo', border: [true, false, false, true] }
            ],
            [
              { text: 'Купон на установку № ' + couponNumber, style: 'h1', border: [false, true, true, false] },
              { text: 'Купон на установку № ' + couponNumber, style: 'h1', border: [true, true, true, false] },
            ],
          ]
        },

        layout: {
          hLineWidth: function (i, node) {
            return (i === 0 || i === node.table.body.length) ? 1 : 1;
          },
          vLineWidth: function (i, node) {
            return (i === 0 || i === node.table.widths.length) ? 1 : 1;
          },
          hLineColor: function (i, node) {
            return (i === 0 || i === node.table.body.length) ? '#e4e4e4' : '#e4e4e4';
          },
          vLineColor: function (i, node) {
            return (i === 0 || i === node.table.widths.length) ? 'gray' : 'gray';
          },
          // paddingLeft: function(i, node) { return 4; },
          // paddingRight: function(i, node) { return 4; },
          // paddingTop: function(i, node) { return 2; },
          // paddingBottom: function(i, node) { return 2; }
        },
      },

      {
        table: {

          widths: ['*', '*'],
          body: [

            [
              { text: 'От правильности установки и ввода в эксплуатацию аппарата зависит не только срок работы техники и его гарантийное обслуживание, но так же и здоровье вас и вашей семьи. Доверьтесь профессионалам! ', style: 'text', border: [false, false, true, true] },
              {
                    text: [
                      { text: 'По всем вопросам установки обращайтесь по телефону: ' },
                      { text: '8-902-100-ХХХХ; ХХ-ХХ-ХХ', bold: true }
                    ],
                    style: 'text2',
              },
            ],
            [
              {
                stack: [
                  {
                    text: infoText, 
                    style: 'text',
                    bold: false
                  },
                  {
                    text: 'Работы входящие в стоимость купона:', 
                    style: 'text',
                    bold: true,
                    margin: [0, 5, 0, 0]
                  },
                  {
                    ul: worksInCoupon,
                    style: 'text', 
                    margin: [10, 0, 0, 0]
                  },
                  // {
                  //   ul: [
                  //     { text: 'Выезд специалиста по городу (возможен выезд специалиста в радиусе 50 км от города, который оплачивается по действующему прайс-листу Сервисной Компании)', style: 'text', margin: [10, 0, 0, 0] },
                  //     { text: 'Распаковка и визуальная проверка техники', style: 'text', margin: [10, 0, 0, 0] },
                  //     { text: 'Проверка исправности и готовности к подключению водо-, электросети и системы канализации.', style: 'text', margin: [10, 0, 0, 0] },
                  //     { text: 'Снятие транспортных креплений', style: 'text', margin: [10, 0, 0, 0] },
                  //     { text: 'Установка техники на место эксплуатации и выставление по уровню в разных плоскостях для исключения вибрации', style: 'text', margin: [10, 0, 0, 0] },
                  //     { text: 'Доработка сети электроснабжения: установка розетки с заземляющим контактом; Перфорация стен (перегородок) для прокладки коммуникаций; Прокладка электрического кабеля открытым способом (до 9 м.); монтажные работы в электрощитке.', style: 'text', margin: [10, 0, 0, 0] },
                  //     { text: 'Доработка системы водоснабжения: Перфорация стен (перегородок) для прокладки коммуникаций; монтаж водопроводного крана в водосеть клиента; замена/сращивание/ удлинение наливного, шланга, гибкой подводки', style: 'text', margin: [10, 0, 0, 0] },
                  //     { text: 'Доработка системы канализации: замена/сращивание/удлинение, сливного шланга; организация стационарного слива', style: 'text', margin: [10, 0, 0, 0] },
                  //     { text: 'Подключение к существующим точкам водо-, электроснабжения и системе канализации, с учетом требований производителя техники и «Правил техники безопасности»', style: 'text', margin: [10, 0, 0, 0] },
                  //     { text: 'Проверка герметичности всех соединений', style: 'text', margin: [10, 0, 0, 0] },
                  //     { text: 'Проверка работоспособности техники.', style: 'text', margin: [10, 0, 0, 0] },
                  //     { text: 'Очистка рабочей зоны и уборка мусора, оставшегося после установки', style: 'text', margin: [10, 0, 0, 0] },
                  //     { text: 'Демонстрация работы Вашей новой техники и объяснение основных функций', style: 'text', margin: [10, 0, 0, 0] },

                  //   ],
                    
                  // },
                  {
                    text: [
                      { 
                        text:'Материалы входящие в стоимость купона: ',
                        style: 'text',
                        margin: [0, 15, 0, 0],
                        bold: true 
                      },
                      {
                        text: materialsInCoupon,
                        style: 'text'
                      }
                    ]
                  },
                  {
                    text: [
                      { 
                        text:'В стоимость подключения не входит: ',
                        style: 'text',
                        margin: [0, 15, 0, 0],
                        bold: true 
                      },
                      {
                        text: worksNotIncludeInCoupon,
                        style: 'text'
                      }
                    ]
                  },
                  {
                    text: 'Дополнительная информация:', 
                    style: 'text',
                    bold: true,
                    margin: [0, 5, 0, 0]
                  },
                  {
                    ul: additionalInfo,
                    style: 'text', 
                    margin: [10, 0, 0, 0]
                  },
                  {
                    text: [
                      'По всем вопросам обращайтесь по телефону: ',
                      { text: '8-902-100-ХХХХ; ХХ-ХХ-ХХ', bold: true }
                    ],
                    margin: [0, 5, 0, 0],
                    style: 'text'
                  },
                  {
                    text: [
                      'Texника: ',
                      { text: '                                                 ', decoration: 'underline' },
                      'Серия №: ',
                      { text: '                                                 ', decoration: 'underline' },
                    ],
                    margin: [0, 5, 0, 0]
                  },
                  {
                    text: [

                      { text: 'Гарантия на установку 12 месяцев. По вопросам гарантии на установку техники обращайтесь по телефону: ' },
                      { text: '8-902-100-ХХХХ; ХХ-ХХ-ХХ', bold: true }
                    ],
                    style: 'text',
                    margin: [0, 5, 0, 0]
                  },
                  {
                    text: [
                      'Подпись продавца: ',
                      { text: '                         ', decoration: 'underline' },
                      { text: '  / ' },
                      { text: '                         ', decoration: 'underline' },
                    ],
                    margin: [0, 10, 0, 0]
                  },
                  {
                    text: [
                      'Подпись покупателя: ',
                      { text: '                         ', decoration: 'underline' },
                      { text: '  / ' },
                      { text: '                         ', decoration: 'underline' },
                    ],
                    margin: [0, 10, 0, 0]
                  },
                  {
                    text: [
                      'Установка произведена мастером: ',
                      { text: '                         ', decoration: 'underline' },
                      { text: '  / ' },
                      { text: '                         ', decoration: 'underline' },
                    ],
                    margin: [0, 10, 0, 0]
                  }
                ],
                border: [false, false, true, true]
              },
              {
                border: [true, false, false, true],
                stack: [
                  
                  {
                    text: 'Установка  производиться только при наличии купона на установку и чека на оплату услуги.',
                    style: 'text2'
                  },
                  {
                    text: 'Срок действия купона 3 месяца',
                    style: 'text2'
                  },
                  {
                    text: [
                      'Наименование купона: ',
                      { text: productFullName, style: 'h1', bold: true }
                    ],
                    margin: [0, 10, 0, 0]
                  },
                  {
                    text: [
                      'Дата продажи: ',
                      { text: payDate, style: 'h1', bold: true }
                    ],
                    margin: [0, 5, 0, 0]
                  },
                  {
                    text: [
                      'ФИО покупателя: ',
                      customerFullName,
                    ],
                    margin: [0, 5, 0, 0]
                  },
                  {
                    text: [
                      'Texника: ',
                      { text: '                                                 ', decoration: 'underline' },
                      'Серия №: ',
                      { text: '                                                 ', decoration: 'underline' },
                    ],
                    margin: [0, 5, 0, 0]
                  },
                  {
                    text: [
                      'Дата установки:', ' «',
                      { text: dateValue }, '» ',

                      { text: '                                  ', decoration: 'underline' },
                      { text: ' 201 ' },
                      { text: '    ', decoration: 'underline' }, ' г.'
                    ],
                    margin: [0, 5, 0, 0]
                  },
                  {
                    text: [
                      'Подпись продавца: ',
                      { text: '                         ', decoration: 'underline' },
                      { text: '  / ' },
                      { text: '                         ', decoration: 'underline' },
                    ],
                    margin: [0, 15, 0, 0]
                  },
                  {
                    text: [
                      'Подпись покупателя: ',
                      { text: '                         ', decoration: 'underline' },
                      { text: '  / ' },
                      { text: '                         ', decoration: 'underline' },
                    ],
                    margin: [0, 10, 0, 0]
                  },
                  {
                    text: [
                      'Установка произведена мастером: ',
                      { text: '                         ', decoration: 'underline' },
                      { text: '  / ' },
                      { text: '                         ', decoration: 'underline' },
                    ],
                    margin: [0, 10, 0, 0]
                  },
                  {
                    text: '.                                                                                                                                         ',
                    decoration: 'overline',
                    decorationStyle: 'dashed',
                    margin: [0, 5, 0, 0]
                  },
                  {
                    text: 'Купон на установку № '+couponNumber,
                    style: 'h1',
                    border: [true, true, true, false]
                  },
                  {
                    text: [
                      'Дата продажи: ',
                      { text: payDate, style: 'h1', bold: true }
                    ],
                    margin: [0, 15, 0, 0]
                  },
                  {
                    text: [
                      'Наименование купона: ',
                      { text: productFullName, style: 'h1', bold: true }
                    ],
                    margin: [0, 10, 0, 0]
                  },
                  {
                    text: [
                      'Дата установки:', ' «',
                      { text: dateValue, decoration: 'underline' }, '» ',

                      { text: '                                  ', decoration: 'underline' },
                      { text: ' 201 ' },
                      { text: '    ', decoration: 'underline' }, ' г.'
                    ],
                    margin: [0, 15, 0, 0]
                  },
                  {
                    text: [
                      'Подпись продавца: ',
                      { text: '                         ', decoration: 'underline' },
                      { text: '  / ' },
                      { text: '                         ', decoration: 'underline' },
                    ],
                    margin: [0, 15, 0, 0]
                  },
                  {
                    text: [
                      'Подпись покупателя: ',
                      { text: '                         ', decoration: 'underline' },
                      { text: '  / ' },
                      { text: '                         ', decoration: 'underline' },
                    ],
                    margin: [0, 15, 0, 0]
                  },
                  {
                    text: [
                      'Претензий к установке не имею. Место установку и сумма дополнительных работы согласовано до проведения монтажа: ',

                    ],
                    margin: [0, 15, 0, 0]
                  },
                  {
                    text: [

                      { text: '.                         ', decoration: 'underline' },
                      { text: '  / ' },
                      { text: '                         ', decoration: 'underline' },
                    ],
                    margin: [0, 15, 0, 0]
                  },
                  {
                    text: [
                      'Установка произведена мастером: ',
                      { text: '                         ', decoration: 'underline' },
                      { text: '  / ' },
                      { text: '                         ', decoration: 'underline' },
                    ],
                    margin: [0, 10, 0, 0]
                  },

                ]
              }
            ]
          ]
        },

        layout: {
          hLineWidth: function (i, node) {
            return (i === 0 || i === node.table.body.length) ? 0 : 1;
          },
          vLineWidth: function (i, node) {
            return (i === 0 || i === node.table.widths.length) ? 1 : 1;
          },
          hLineColor: function (i, node) {
            return (i === 0 || i === node.table.body.length) ? '#e4e4e4' : '#e4e4e4';
          },
          vLineColor: function (i, node) {
            return (i === 0 || i === node.table.widths.length) ? 'gray' : 'gray';
          },
          // paddingLeft: function(i, node) { return 4; },
          // paddingRight: function(i, node) { return 4; },
          //paddingTop: function(i, node) { return 0; },
          // paddingBottom: function(i, node) { return 2; }
        },
      }

    ],

    styles: {
      headerInfo: {
        fontSize: 8,
        alignment: 'center',
        margin: [0, 0, 0, 0],

      },
      h1: {
        fontSize: 11,
        alignment: 'center',
        margin: [0, 0, 0, 0],

      },
      text: {
        fontSize: 9,
        alignment: 'left',
        margin: [0, 0, 0, 0],
      },
      text2: {
        fontSize: 10,
        alignment: 'left',
        margin: [0, 0, 0, 0],
      },
      xsmall: {
        decoration: 'overline',
        decorationStyle: 'dashed',
        paddingTop: '40'
      }



    }
  }
  
  return couponDocDefinition;


}