
const bigDictionary = {
  "Подключ. WM (стандарт)":["","Стандартное подключение стиральной машины: производится к уже имеющимся у Вас коммуникациям, без их доработки","","Работы входящие в стоимость:","","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Проверка исправности и готовности к подключению к имеющимся точкам водоснабжения, электроснабжения и системе слива","Снятие транспортных креплений","","","","","Установка техники на место эксплуатации и выставление по уровню","","","","","","","","","","","","","","","","","","","","Подключение к существующим точкам водо- и электроснабжения с использованием деталей, входящих в комплект поставки, а также с учетом требований производителей техники, «Правил техники безопасности» и контролирующих органов самоуправления, без доработки","Подключение стационарного слива, при необходимости установка манжетки или червячного хомута","Проверка герметичности всех соединений","","","","","","","","","","","","","","","","","","","","","","","Проверка работоспособности техники","Очистка рабочей зоны","Демонстрация работы Вашей новой техники и объяснение основных функций","","Материалы, входящие в стоимость.","","Хомут червячный или муфта","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","В стоимость подключения не входит:","","Отключение и демонтаж старой техники","Выравнивание пола и штробление стен","Работы по изменению конфигурации шкафов или рабочих поверхностей","Встраивание техники в мебель","","","","Доработка коммуникаций и удлинение шнуров питания","","","","","","","","","","","","","","","Дополнительная информация:","","","","","","","","","","","","","LAST LINE","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
  "Подключ. WM (Премиум)":["","Премиум подключение стиральной машины: производится установка и подключение техники, а так же доработка  точек водоснабжения, электроснабжения и системы слива","","Работы входящие в стоимость:","","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Проверка исправности и готовности к подключению водоснабжения, электроснабжения и системе слива.","Снятие транспортных креплений","","","","","Установка техники на место эксплуатации и выставление по уровню","","Доработка сети электроснабжения: установка розетки с заземляющим контактом; Перфорация стен (перегородок) для прокладки коммуникаций; Прокладка электрического кабеля открытым способом (до 5 м.); Монтажные работы в электрощитке.","Доработка системы водоснабжения: Перфорация стен (перегородок) для прокладки коммуникаций; Монтаж водопроводного крана в водосеть клиента; Замена/сращивание/удлинение наливного, шланга (до 4 м.), гибкой подводки;","Доработка системы канализации: Замена/сращивание/удлинение, сливного шланга ( до 1 м.); Организация стационарного слива","","","","","","","","","","","","","","","","Подключение к точкам водо-, электроснабжения и системе канализации с учетом требований производителей техники, «Правил техники безопасности» и контролирующих органов самоуправления","","Проверка герметичности всех соединений","","","","","","","","","","","","","","","","","","","","","","","Проверка работоспособности техники.","Очистка рабочей зоны","Демонстрация работы Вашей новой техники и объяснение основных функций","","Материалы, входящие в стоимость.","","","Розетка ","Вилка ","Автомат 16 А. / 2п. (отеч.)","Коробка под автомат","Провод ПВС  3*1,5 мм. (белый)","Провод МПВ 4.0 мм (белый)","Крепежные изделия пластиковые зажимы для кабеля 7-8 мм","Сливной шланг до 1 м.","Концевик на модульный сливной шланг","Крепежные хомуты ","Сифон с отводом для подключения СМА и ПММ","Гибкий гофрированный выпуск к сифону","Патрубок прямой - d.40 (d.50) мм.","Ниппель для сращивания сливных шлангов d.19/d.21 мм. (пласт.)","Муфта резиновая d.50*d.73 мм.","Шланг наливной пластиковый (Италия) до 4 м","Подводка гибкая бронированная на воду","Кран","Водоотвод латунный (в сборе)","Тройник","Переходник","Муфта, бочонок.","","","","","","","","","","","","","","","","","","В стоимость подключения не входит:","","Отключение и демонтаж старой техники","Выравнивание пола и штробление стен","Работы по изменению конфигурации шкафов или рабочих поверхностей","Встраивание техники в мебель","","","","","","","","","","","","","","","","","","","Дополнительная информация:","","","","","","","","","","","","","LAST LINE","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""],
  "Подключ.В\\ WM (стандарт)":["","Стандартное подключение встроенной стиральной машины: производится к уже имеющимся у Вас коммуникациям, без их доработки","","Работы входящие в стоимость:","","Выезд специалиста по городу (выезд мастера за пределы города оплачивается по действующему прайс-листу на дополнительные работы)","","Распаковка и визуальная проверка техники на предмет отсутствия механических повреждений и целостности комплектности.","Консультация по вопросам эксплуатации","Проверка исправности и готовности к подключению к имеющимся точкам водоснабжения, электроснабжения и системе слива","Снятие транспортных креплений","","","","Перфорация стен (мебельных перегородок) для прокладки коммуникаций","Установка техники на место эксплуатации и выставление по уровню","","","","","","","","","","","","","","","","","","","","Подключение к существующим точкам водо- и электроснабжения с использованием деталей, входящих в комплект поставки, а также с учетом требований производителей техники, «Правил техники безопасности» и контролирующих органов самоуправления, без доработки","Подключение стационарного слива, при необходимости установка манжетки или червячного хомута","Проверка герметичности всех соединений","","","","","","","","","","","","","","","","","","","","","","","Проверка работоспособности техники","Очистка рабочей зоны","Демонстрация работы Вашей новой техники и объяснение основных функций","","Материалы, входящие в стоимость.","","Хомут червячный или муфта","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","В стоимость подключения не входит:","","Отключение и демонтаж старой техники","Выравнивание пола и штробление стен","Работы по изменению конфигурации шкафов или рабочих поверхностей","","","Навеска фасада на технику","","Доработка коммуникаций и удлинение шнуров питания","","","","","","","","","","","","","","","Дополнительная информация:","","","","","","","","","","","","","LAST LINE","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","","",""]
}

function getWorks (id) {
  let worksArr = [];

  let begin = bigDictionary[id].indexOf('Работы входящие в стоимость:') + 1;
  let end = bigDictionary[id].indexOf('Материалы, входящие в стоимость.') - 1; 
  worksArr = bigDictionary[id].slice(begin, end);
  
  return worksArr
}

function getMaterials (id) {
  let materials = [];

  let begin = bigDictionary[id].indexOf('Материалы, входящие в стоимость.') + 1;
  let end = bigDictionary[id].indexOf('В стоимость подключения не входит:') - 1; 
  materials = bigDictionary[id].slice(begin, end).filter( function (item) {
    return Boolean(item)
  }).map(function(item,i) { 
    console.log(item);
    return ' ' + item
    });

  return materials

}

function worksNotInclude(id) {

  let works = [];
  
  let begin = bigDictionary[id].indexOf('В стоимость подключения не входит:') + 1;
  let end = bigDictionary[id].indexOf('Дополнительная информация:') - 1; 
  works = bigDictionary[id].slice(begin, end).filter( function (item) {
    return Boolean(item)
  }).map(function(item,i) { 
    console.log(item);
    return ' ' + item
    });

  return works
}

function returnSpacesUnderline (number,fullname) {
  let spacesUnderline = '';
  for (var i = 1; i < number; i++) {
    spacesUnderline +=' ';
    
  }
  return fullname ? fullname : { text: spacesUnderline, decoration: 'underline' } 
}

function getInfoText(id) {
  return bigDictionary[id][1]
}

function getAdditionalInfo(id) {
  let additionalInfo = ''
  let begin = bigDictionary[id].indexOf('Дополнительная информация:') + 1;
  let end = bigDictionary[id].indexOf('LAST LINE') - 1; 

  additionalInfo = bigDictionary[id].slice(begin,end);

  return additionalInfo;

}  



export let getNewDefinition = function (orderObj) {

  console.log(orderObj);

  let infoText = getInfoText(orderObj.row.productFullName);
  let productFullName = orderObj.row.productFullName;
  let customerFullName = returnSpacesUnderline(100, orderObj.row.fullname) ;
  let couponNumber = orderObj.row.couponNumber;
  let worksInCoupon = getWorks(orderObj.row.productFullName);
  let materialsInCoupon = getMaterials (orderObj.row.productFullName);
  let worksNotIncludeInCoupon = worksNotInclude(orderObj.row.productFullName);
  let additionalInfo = getAdditionalInfo(orderObj.row.productFullName);
  let dateValue = orderObj.row.dateValue;
  let payDate = orderObj.row.payDate;

  let couponDocDefinition = {
    pageSize: 'A4',
    pageOrientation: 'landscape',
    pageMargins: [5, 5, 5, 5],

    info: {
      title: 'Купон на установку {{couponNumber}}',
      author: '{{username}}',
      subject: '{{productFullName}}',
      keywords: '',
    },




    content: [

      {
        table: {

          widths: ['*', '*'],
          body: [
            [
              { text: 'Левая часть остается у мастера', style: 'headerInfo', border: [false, false, true, true] },
              { text: 'Правая часть остается у мастера', style: 'headerInfo', border: [true, false, false, true] }
            ],
            [
              { text: 'Купон на установку № ' + couponNumber, style: 'h1', border: [false, true, true, false] },
              { text: 'Купон на установку № ' + couponNumber, style: 'h1', border: [true, true, true, false] },
            ],
          ]
        },

        layout: {
          hLineWidth: function (i, node) {
            return (i === 0 || i === node.table.body.length) ? 1 : 1;
          },
          vLineWidth: function (i, node) {
            return (i === 0 || i === node.table.widths.length) ? 1 : 1;
          },
          hLineColor: function (i, node) {
            return (i === 0 || i === node.table.body.length) ? '#e4e4e4' : '#e4e4e4';
          },
          vLineColor: function (i, node) {
            return (i === 0 || i === node.table.widths.length) ? 'gray' : 'gray';
          },
          // paddingLeft: function(i, node) { return 4; },
          // paddingRight: function(i, node) { return 4; },
          // paddingTop: function(i, node) { return 2; },
          // paddingBottom: function(i, node) { return 2; }
        },
      },

      {
        table: {

          widths: ['*', '*'],
          body: [

            [
              { text: 'От правильности установки и ввода в эксплуатацию аппарата зависит не только срок работы техники и его гарантийное обслуживание, но так же и здоровье вас и вашей семьи. Доверьтесь профессионалам! ', style: 'text', border: [false, false, true, true] },
              {
                    text: [
                      { text: 'По всем вопросам установки обращайтесь по телефону: ' },
                      { text: '8-902-100-ХХХХ; ХХ-ХХ-ХХ', bold: true }
                    ],
                    style: 'text2',
              },
            ],
            [
              {
                stack: [
                  {
                    text: infoText, 
                    style: 'text',
                    bold: false
                  },
                  {
                    text: 'Работы входящие в стоимость купона:', 
                    style: 'text',
                    bold: true,
                    margin: [0, 5, 0, 0]
                  },
                  {
                    ul: worksInCoupon,
                    style: 'text', 
                    margin: [10, 0, 0, 0]
                  },
                  // {
                  //   ul: [
                  //     { text: 'Выезд специалиста по городу (возможен выезд специалиста в радиусе 50 км от города, который оплачивается по действующему прайс-листу Сервисной Компании)', style: 'text', margin: [10, 0, 0, 0] },
                  //     { text: 'Распаковка и визуальная проверка техники', style: 'text', margin: [10, 0, 0, 0] },
                  //     { text: 'Проверка исправности и готовности к подключению водо-, электросети и системы канализации.', style: 'text', margin: [10, 0, 0, 0] },
                  //     { text: 'Снятие транспортных креплений', style: 'text', margin: [10, 0, 0, 0] },
                  //     { text: 'Установка техники на место эксплуатации и выставление по уровню в разных плоскостях для исключения вибрации', style: 'text', margin: [10, 0, 0, 0] },
                  //     { text: 'Доработка сети электроснабжения: установка розетки с заземляющим контактом; Перфорация стен (перегородок) для прокладки коммуникаций; Прокладка электрического кабеля открытым способом (до 9 м.); монтажные работы в электрощитке.', style: 'text', margin: [10, 0, 0, 0] },
                  //     { text: 'Доработка системы водоснабжения: Перфорация стен (перегородок) для прокладки коммуникаций; монтаж водопроводного крана в водосеть клиента; замена/сращивание/ удлинение наливного, шланга, гибкой подводки', style: 'text', margin: [10, 0, 0, 0] },
                  //     { text: 'Доработка системы канализации: замена/сращивание/удлинение, сливного шланга; организация стационарного слива', style: 'text', margin: [10, 0, 0, 0] },
                  //     { text: 'Подключение к существующим точкам водо-, электроснабжения и системе канализации, с учетом требований производителя техники и «Правил техники безопасности»', style: 'text', margin: [10, 0, 0, 0] },
                  //     { text: 'Проверка герметичности всех соединений', style: 'text', margin: [10, 0, 0, 0] },
                  //     { text: 'Проверка работоспособности техники.', style: 'text', margin: [10, 0, 0, 0] },
                  //     { text: 'Очистка рабочей зоны и уборка мусора, оставшегося после установки', style: 'text', margin: [10, 0, 0, 0] },
                  //     { text: 'Демонстрация работы Вашей новой техники и объяснение основных функций', style: 'text', margin: [10, 0, 0, 0] },

                  //   ],
                    
                  // },
                  {
                    text: [
                      { 
                        text:'Материалы входящие в стоимость купона: ',
                        style: 'text',
                        margin: [0, 15, 0, 0],
                        bold: true 
                      },
                      {
                        text: materialsInCoupon,
                        style: 'text'
                      }
                    ]
                  },
                  {
                    text: [
                      { 
                        text:'В стоимость подключения не входит: ',
                        style: 'text',
                        margin: [0, 15, 0, 0],
                        bold: true 
                      },
                      {
                        text: worksNotIncludeInCoupon,
                        style: 'text'
                      }
                    ]
                  },
                  {
                    text: 'Дополнительная информация:', 
                    style: 'text',
                    bold: true,
                    margin: [0, 5, 0, 0]
                  },
                  {
                    ul: additionalInfo,
                    style: 'text', 
                    margin: [10, 0, 0, 0]
                  },
                  {
                    text: [
                      'По всем вопросам обращайтесь по телефону: ',
                      { text: '8-902-100-ХХХХ; ХХ-ХХ-ХХ', bold: true }
                    ],
                    margin: [0, 5, 0, 0],
                    style: 'text'
                  },
                  {
                    text: [
                      'Texника: ',
                      { text: '                                                 ', decoration: 'underline' },
                      'Серия №: ',
                      { text: '                                                 ', decoration: 'underline' },
                    ],
                    margin: [0, 5, 0, 0]
                  },
                  {
                    text: [

                      { text: 'Гарантия на установку 12 месяцев. По вопросам гарантии на установку техники обращайтесь по телефону: ' },
                      { text: '8-902-100-ХХХХ; ХХ-ХХ-ХХ', bold: true }
                    ],
                    style: 'text',
                    margin: [0, 5, 0, 0]
                  },
                  {
                    text: [
                      'Подпись продавца: ',
                      { text: '                         ', decoration: 'underline' },
                      { text: '  / ' },
                      { text: '                         ', decoration: 'underline' },
                    ],
                    margin: [0, 10, 0, 0]
                  },
                  {
                    text: [
                      'Подпись покупателя: ',
                      { text: '                         ', decoration: 'underline' },
                      { text: '  / ' },
                      { text: '                         ', decoration: 'underline' },
                    ],
                    margin: [0, 10, 0, 0]
                  },
                  {
                    text: [
                      'Установка произведена мастером: ',
                      { text: '                         ', decoration: 'underline' },
                      { text: '  / ' },
                      { text: '                         ', decoration: 'underline' },
                    ],
                    margin: [0, 10, 0, 0]
                  }
                ],
                border: [false, false, true, true]
              },
              {
                border: [true, false, false, true],
                stack: [
                  
                  {
                    text: 'Установка  производиться только при наличии купона на установку и чека на оплату услуги.',
                    style: 'text2'
                  },
                  {
                    text: 'Срок действия купона 3 месяца',
                    style: 'text2'
                  },
                  {
                    text: [
                      'Наименование купона: ',
                      { text: productFullName, style: 'h1', bold: true }
                    ],
                    margin: [0, 10, 0, 0]
                  },
                  {
                    text: [
                      'Дата продажи: ',
                      { text: payDate, style: 'h1', bold: true }
                    ],
                    margin: [0, 5, 0, 0]
                  },
                  {
                    text: [
                      'ФИО покупателя: ',
                      customerFullName,
                    ],
                    margin: [0, 5, 0, 0]
                  },
                  {
                    text: [
                      'Texника: ',
                      { text: '                                                 ', decoration: 'underline' },
                      'Серия №: ',
                      { text: '                                                 ', decoration: 'underline' },
                    ],
                    margin: [0, 5, 0, 0]
                  },
                  {
                    text: [
                      'Дата установки:', ' «',
                      { text: dateValue }, '» ',

                      { text: '                                  ', decoration: 'underline' },
                      { text: ' 201 ' },
                      { text: '    ', decoration: 'underline' }, ' г.'
                    ],
                    margin: [0, 5, 0, 0]
                  },
                  {
                    text: [
                      'Подпись продавца: ',
                      { text: '                         ', decoration: 'underline' },
                      { text: '  / ' },
                      { text: '                         ', decoration: 'underline' },
                    ],
                    margin: [0, 15, 0, 0]
                  },
                  {
                    text: [
                      'Подпись покупателя: ',
                      { text: '                         ', decoration: 'underline' },
                      { text: '  / ' },
                      { text: '                         ', decoration: 'underline' },
                    ],
                    margin: [0, 10, 0, 0]
                  },
                  {
                    text: [
                      'Установка произведена мастером: ',
                      { text: '                         ', decoration: 'underline' },
                      { text: '  / ' },
                      { text: '                         ', decoration: 'underline' },
                    ],
                    margin: [0, 10, 0, 0]
                  },
                  {
                    text: '.                                                                                                                                         ',
                    decoration: 'overline',
                    decorationStyle: 'dashed',
                    margin: [0, 5, 0, 0]
                  },
                  {
                    text: 'Купон на установку № '+couponNumber,
                    style: 'h1',
                    border: [true, true, true, false]
                  },
                  {
                    text: [
                      'Дата продажи: ',
                      { text: payDate, style: 'h1', bold: true }
                    ],
                    margin: [0, 15, 0, 0]
                  },
                  {
                    text: [
                      'Наименование купона: ',
                      { text: productFullName, style: 'h1', bold: true }
                    ],
                    margin: [0, 10, 0, 0]
                  },
                  {
                    text: [
                      'Дата установки:', ' «',
                      { text: '      ', decoration: 'underline' }, '» ',

                      { text: '                                  ', decoration: 'underline' },
                      { text: ' 201 ' },
                      { text: '    ', decoration: 'underline' }, ' г.'
                    ],
                    margin: [0, 15, 0, 0]
                  },
                  {
                    text: [
                      'Подпись продавца: ',
                      { text: '                         ', decoration: 'underline' },
                      { text: '  / ' },
                      { text: '                         ', decoration: 'underline' },
                    ],
                    margin: [0, 15, 0, 0]
                  },
                  {
                    text: [
                      'Подпись покупателя: ',
                      { text: '                         ', decoration: 'underline' },
                      { text: '  / ' },
                      { text: '                         ', decoration: 'underline' },
                    ],
                    margin: [0, 15, 0, 0]
                  },
                  {
                    text: [
                      'Претензий к установке не имею. Место установку и сумма дополнительных работы согласовано до проведения монтажа: ',

                    ],
                    margin: [0, 15, 0, 0]
                  },
                  {
                    text: [

                      { text: '.                         ', decoration: 'underline' },
                      { text: '  / ' },
                      { text: '                         ', decoration: 'underline' },
                    ],
                    margin: [0, 15, 0, 0]
                  },
                  {
                    text: [
                      'Установка произведена мастером: ',
                      { text: '                         ', decoration: 'underline' },
                      { text: '  / ' },
                      { text: '                         ', decoration: 'underline' },
                    ],
                    margin: [0, 10, 0, 0]
                  },

                ]
              }
            ]
          ]
        },

        layout: {
          hLineWidth: function (i, node) {
            return (i === 0 || i === node.table.body.length) ? 0 : 1;
          },
          vLineWidth: function (i, node) {
            return (i === 0 || i === node.table.widths.length) ? 1 : 1;
          },
          hLineColor: function (i, node) {
            return (i === 0 || i === node.table.body.length) ? '#e4e4e4' : '#e4e4e4';
          },
          vLineColor: function (i, node) {
            return (i === 0 || i === node.table.widths.length) ? 'gray' : 'gray';
          },
          // paddingLeft: function(i, node) { return 4; },
          // paddingRight: function(i, node) { return 4; },
          //paddingTop: function(i, node) { return 0; },
          // paddingBottom: function(i, node) { return 2; }
        },
      }

    ],

    styles: {
      headerInfo: {
        fontSize: 8,
        alignment: 'center',
        margin: [0, 0, 0, 0],

      },
      h1: {
        fontSize: 11,
        alignment: 'center',
        margin: [0, 0, 0, 0],

      },
      text: {
        fontSize: 9,
        alignment: 'left',
        margin: [0, 0, 0, 0],
      },
      text2: {
        fontSize: 10,
        alignment: 'left',
        margin: [0, 0, 0, 0],
      },
      xsmall: {
        decoration: 'overline',
        decorationStyle: 'dashed',
        paddingTop: '40'
      }



    }
  }
  
  return couponDocDefinition;


}